[fix] main.go and mermaid diagram in README.md Signed-off-by: karma <captainav0608@gmail.com>
Signed-off-by: karma <captainav0608@gmail.com>
